{"data":{"markdownRemark":{"html":"<p>Some questions to begin the story:</p>\n<ul>\n<li>Why should parents take care of their children when they will move out, get married, and slowly (or sometimes abruptly) drift apart?</li>\n<li>Why should you take a bath everyday when you are going to get dirty in and have to take another one in less than 24 hours?</li>\n<li>What is the point of friends if they will leave sooner or later?</li>\n<li>Why do eat when you are going to pop it out in a few hours?</li>\n<li>What's the point of <code class=\"language-text\">X</code> if it's going to <code class=\"language-text\">Y</code> anyway?</li>\n<li>Why bother with <code class=\"language-text\">X</code>, when it ends in <code class=\"language-text\">N</code>?</li>\n</ul>\n<p>Is this part of Grand Scheme of Things that 99% things ever done are useless? Wasting time? What kind of life you want? Just because it (<em>probably</em>) won't last a lifetime it does not mean that you won't gain anything from it.</p>\n<p>Imagine you have an awesome cake on the table. It would be stupid to throw it away because it's going to <strong>end</strong> anyway after you've eaten it. Just eat it and <strong>enjoy</strong> it while it's there.</p>\n<p>Does it feel like wasting time on friends? Time wasted having fun (including friends) isn't actually wasted. It's worthy investment in friendship, actually. Consider this, few years down the road, you have achieved everything you set out for you. Prize, award, reward, bonanza, jackpot, honour. Whom do you call? Whom do you invite over to your place to celebrate this moment with?</p>\n<p>The older we get, the harder it is to make friends. People become more closed as they grow up. In more years, we are even older. Some might passed away. Where are the memories that will bring some comfort? The excellence(s) of yours certainly won't. Love, heartbreak, suffer, joyful, and almost all experiences in your life will shape you into your future self-character becomes. They will define your personality, your proclivities, your likes and dislikes, your fears, and your social barometer.</p>\n<p>Seize each precious moments and make those memories worth living. It will always be vivid, as if it happened yesterday.</p>\n<p>It is good to have that flaming desire to consume knowledge, fighting for a glory, and strive for excellence. But in the race to get on top, remember that it is lonely up there. Take your friends with you. Life is meant to be lived, not measured.</p>\n<p><small><em>Umm, more I type, more I feel like an older.</em></small></p>\n<p>Does friendship is a natural component of life or just be an on-purpose-activity that should be evaluated in terms of return in time and investment?</p>\n<p>It's important to spend time on self-improvement and making life better. But sooner rather than later, realize that life isn't meant for that. Human being are social beings and it's not natural for us to stay alone forever. How far will you improve alone? And to what end?</p>\n<h3 id=\"on-advice-choose-wisely\"><a href=\"#on-advice-choose-wisely\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>On Advice Choose Wisely</h3>\n<p>Still not found the right people? Once find them, all measurement, standard, qualification, and this-kind-of-things rationality and practicality will disappear. Invest in the <strong>right</strong> people. Don't focus on putting effort into making friendships, just allow them to come along and make themselves known, because they will, quite easily actually. Real friends <strong>shine</strong> through the rest.</p>\n<h3 id=\"on-the-pursuit-of-happiness\"><a href=\"#on-the-pursuit-of-happiness\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>On The Pursuit of Happiness</h3>\n<blockquote>\n<p>\"Happiness is real . . . only when shared.\"<br>\n~ Into the Wild</p>\n</blockquote>\n<p>Everyone is frantically looking for happiness all around, not knowing where it is. Our happiness lies in the happiness of other people. Give them their happiness, you will get your own happiness. And this is the purpose of human life, the pursuit of happiness.</p>","timeToRead":3,"excerpt":"Some questions to begin the story: Why should parents take care of their children when they will move out, get married, and slowly (or…","frontmatter":{"title":"Words in Friends Word","cover":"/images/post-covers/friends.jpeg","date":"2015-06-28","category":"Lyfe","tags":["life","friends","words"],"author":null},"fields":{"slug":"/words-in-friends-word"}},"prev":{"excerpt":"Lie(s) People lie \nEverybody lie \nParent lie \nOthers lie \nEven myself lie I hate people \nI hate everybody \nI…","frontmatter":{"title":"Lie","cover":"/images/post-covers/catsu.jpeg","date":"2015-09-10"},"fields":{"slug":"/lie"}},"next":{"excerpt":"To whom it may concern, Pretending to be good people in front of her \nBeing gentle to her \nAnd no matter how…","frontmatter":{"title":"Treacherous","cover":"/images/post-covers/candle-flame-water.jpg","date":"2015-06-12"},"fields":{"slug":"/treacherous"}},"authors":{"edges":[{"node":{"uid":"fauzana","name":"Fauzana S","image":"/images/fauzana_150x150.jpeg","url":"https://fauzana.com/","bio":"Berkepala batu. Bertangan besi. Berhati rapuh."}}]}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/words-in-friends-word","total":10,"prev":"/lie","next":"/treacherous"}}